{
  "frameworks": [
    {
      "name": "ISO 27001/ISO 27002",
      "definition": "ISO 27001 is an international standard that provides a framework for risk assessment, control selection, and implementation. This framework is best when used in tandem with ISO 27002. ISO 27002 contains detailed guidelines for selecting and implementing security controls outlined in ISO 27001.",
      "how_to_use": [
        "1. Assess the organization’s size, industry, and information assets. Identify the Information Security Management System (ISMS).",
        "2. Perform a risk assessment, assess their impacts, likelihood, and prioritize them.",
        "3. Use ISO 27002 in order to identify specific controls such as access management and encryption.",
        "4. Based on specific controls in the organization, create security policies and risk treatment plans.",
        "5. Continue to monitor and review the organization’s level of risk, and conduct regular risk assessments to identify threats.",
        "6. Educate staff about ISO 27001/27002 guidelines."
      ],
      "advantages": [
        "Robust.",
        "Information Security Management System is identified.",
        "Effective security measures."
      ],
      "disadvantages": [
        "Highly technical.",
        "Knowledge gap in implementation."
      ],
      "link": "https://drata.com/grc-central/iso-27001/iso-27001-vs-iso-27002"
    },
    {
      "name": "NIST CSF",
      "definition": "Framework created by the National Institute of Standards and Technology (NIST). It is organized into five core functions: Identify, Protect, Detect, Respond, and Recover. The main goal of this framework is to align cybersecurity activities with business requirements.",
      "how_to_use": [
        "1. Use the main functions (Identify, Protect, Detect, Respond, and Recover) to evaluate current cybersecurity systems.",
        "2. Determine the most critical assets, risks, and threats based on the specific organization.",
        "3. Decide what threats are most critical, and where the organization’s cybersecurity state needs improvement.",
        "4. Apply best practices to address these threats and continually reassess current threats and vulnerabilities."
      ],
      "advantages": [
        "Flexible.",
        "Common terminology reduces confusion."
      ],
      "disadvantages": [
        "55-page manual is long to read.",
        "Self-assessment leads to no clear standards."
      ],
      "link": "https://nvlpubs.nist.gov/nistpubs/CSWP/NIST.CSWP.29.pdf"
    },
    {
      "name": "CIS Controls",
      "definition": "Best practices developed by the Center of Internet Security (CIS) that contain 18 high-priority actions. These are grouped into three groups: Basic, Foundational, and Organizational. Basic controls are essential for small organizations. Foundational controls are for a company with a more mature security program. Organizational controls assess security policies and governance.",
      "how_to_use": [
        "1. Understand and assess the 18 CIS controls, such as secure configuration, vulnerability management, and inventory and control of assets.",
        "2. Conduct a self-assessment to identify gaps in current security practices compared to CIS controls.",
        "3. Start with basic controls, then foundational, and finally organizational controls to establish a strong security foundation. Apply these controls incrementally.",
        "4. Regularly review and update the approach to address different threats or business changes."
      ],
      "advantages": [
        "Simple and actionable.",
        "Mapped to real-world threats."
      ],
      "disadvantages": [
        "Not as comprehensive as other frameworks.",
        "Requires regular updates."
      ],
      "link": "https://www.cisecurity.org/controls"
    },
    {
      "name": "COBIT",
      "definition": "COBIT is the Control Objectives for Information and Related Technologies and is a specific framework for IT governance and management. This framework includes tools, practices, and models to manage an IT organization.",
      "how_to_use": [
        "1. Figure out IT compliance objectives with business goals and needs, focusing on risk management and prevention.",
        "2. Perform a gap analysis to assess IT governance practices currently used in the company.",
        "3. Apply COBIT principles, including evaluating stakeholder needs, having clear responsibilities and roles, and regularly assessing and making recommendations for performance management.",
        "4. Continuously improve governance practices to understand different business needs."
      ],
      "advantages": [
        "Aligns IT with business needs.",
        "Detailed governance framework."
      ],
      "disadvantages": [
        "Complex implementation for small businesses.",
        "Expensive and time-consuming."
      ],
      "link": "https://www.techtarget.com/searchsecurity/definition/COBIT"
    },
    {
      "name": "ISO/IEC 27701",
      "definition": "International Standard for privacy information management. This framework extends ISO 27001 to focus on personally identifiable information. The main goal of this framework is to protect personally identifiable information.",
      "how_to_use": [
        "1. Integrate with ISO 27001 if already using that framework. If not, begin with ISO 27001, then return to ISO/IEC 27701.",
        "2. Define the personally identifiable information that the organization stores, collects, and shares.",
        "3. Perform a risk assessment to determine appropriate privacy controls to mitigate risks.",
        "4. Develop privacy policies and controls that cover data handling, user rights, and breach response actions.",
        "5. Train employees on privacy laws and how to protect personally identifiable information.",
        "6. Continuously monitor and assess privacy policies and controls to decide when changes are necessary."
      ],
      "advantages": [
        "Expands ISO 27001 for privacy information management."
      ],
      "disadvantages": [
        "Complicated integration with existing systems.",
        "High implementation costs."
      ],
      "link": "https://www.vanta.com/collection/iso-27001/guide-to-iso-27701"
    }
  ]
}


